podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/PIT0_MKL82Z7.svd.xml
<!--
Devices using this peripheral: 
      MKL82Z7
-->
      <peripheral>
         <?sourceFile "PIT0_MKL82Z7" ?>
         <name>PIT</name>
         <description>Periodic Interrupt Timer</description>
         <groupName>PIT</groupName>
         <headerStructName>PIT</headerStructName>
         <baseAddress>0x40037000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0xE0</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100</offset>
            <size>0x40</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MCR</name>
               <description>Module Control Register</description>
               <addressOffset>0x0</addressOffset>
               <fields>
                  <field>
                     <name>FRZ</name>
                     <description>Freeze\n
Determines if timers are stopped in Debug mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Timers run in Debug</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timers stop in Debug</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MDIS</name>
                     <description>Module Disable\n
Disabled PIT module clock</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>LTMR64H</name>
               <description>PIT Upper Lifetime Timer Register</description>
               <addressOffset>0xE0</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LTH</name>
                     <description>Life Timer value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>LTMR64L</name>
               <description>PIT Lower Lifetime Timer Register</description>
               <addressOffset>0xE4</addressOffset>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>LTL</name>
                     <description>Life Timer value</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>4</dim>
               <dimIncrement>16</dimIncrement>
               <dimIndex>0,1,2,3</dimIndex>
               <name>CHANNEL,@p@f@i</name>
               <addressOffset>0x100</addressOffset>
               <register>
                  <name>LDVAL</name>
                  <description>Timer Load Value Register</description>
                  <addressOffset>0x0</addressOffset>
                  <fields>
                     <field>
                        <name>TSV</name>
                        <description>Start Value</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CVAL</name>
                  <description>Current Timer Value Register</description>
                  <addressOffset>0x4</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>TVL</name>
                        <description>Current Value</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TCTRL</name>
                  <description>Timer Control Register</description>
                  <addressOffset>0x8</addressOffset>
                  <fields>
                     <field>
                        <name>TEN</name>
                        <description>Timer Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Timer disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Timer enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TIE</name>
                        <description>Timer Interrupt Enable\n
Enables interrupt requests from Timer</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Interrupt disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Interrupt enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CHN</name>
                        <description>Chain Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Timer is not chained</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Timer is chained to previous timer. For example, for Channel 2, if this field is set, Timer 2 is chained to Timer 1</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>TFLG</name>
                  <description>Timer Flag Register</description>
                  <addressOffset>0xC</addressOffset>
                  <fields>
                     <field>
                        <name>TIF</name>
                        <description>Timer Interrupt Flag</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Timeout not occurred</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Timeout has occurred</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
